import 'package:flutter/material.dart';
import 'package:path/path.dart';

class TermsPage extends StatelessWidget {
  const TermsPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.transparent,
        elevation: 0,
        foregroundColor: Theme.of(context).colorScheme.inversePrimary,
        title: Text(
          'Οροι χρήσης',
          style: TextStyle(fontWeight: FontWeight.bold),
        ),
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.all(8.0),
          child: const Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Text(
                'Α. Εισαγωγή',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 18),
              ),
              Text(
                '''Η εδρεύουσα στο Μαρούσι Αττικής, (Κηφισίας 10-12), εταιρεία «ΑΝΤΕΝΝΑ TV ΜΟΝΟΠΡΟΣΩΠΗ Α.Ε.» (η «Διοργανώτρια») πάροχος τηλεοπτικού προγράμματος ελεύθερης λήψης Εθνικής εμβέλειας, μεταδιδόμενου υπό το λογότυπο «ΑΝΤΕΝΝΑ TV» (ο «Σταθμός»), διοργανώνει, στο πλαίσιο του παραγόμενου και μεταδιδόμενου από τον Σταθμό προγράμματος, κατ’ αρχήν από Δευτέρα έως και Παρασκευή, από ώρα 05:45 π.μ. έως 9:50 π.μ. (ή άλλες ημέρες/ώρες, που θα επιλέξει η Διοργανώτρια, κατά την κρίση της) τηλεοπτικού προγράμματος με τον τίτλο «ΚΑΛΗΜΕΡΑ ΕΛΛΑΔΑ στον ΑΝΤΕΝΝΑ ΤV» (η «Εκπομπή») προωθητικές ενέργειες και δη διαγωνισμούς, κληρώσεις κ.λπ. (οι «Προωθητικές Ενέργειες»).\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Την τεχνική υποστήριξη των Προωθητικών Ενεργειών έχει αναλάβει η εδρεύουσα στην Καλλιθέα Αττικής (Λ. Θησέως 280), εταιρεία «ΕΙΔΗΣΕΟΦΩΝΙΚΗ ΕΛΛΑΣ Α.Ε.Ε.» (ο « Πάροχος»), ο ρόλος και η ευθύνη της οποίας περιορίζεται και εξαντλείται στην παροχή της τηλεπικοινωνιακής υποδομής και των συστημάτων τηλεηχοπληροφόρησης και SMS που διαθέτει προς χρήση, κατ’ εντολή και για λογαριασμό της Διοργανώτριας για τους σκοπούς των Προωθητικών Ενεργειών και των όσων λοιπών αναφέρονται κατωτέρω στους παρόντες όρους.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                'Β. Περιγραφή των Προωθητικών Ενεργειών - Τρόπος Συμμετοχής',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 18),
              ),
              Text(
                '''Πληροφορίες για τη διάρκεια κάθε Προωθητικής Ενέργειας (έναρξη &amp; λήξη), τον χρόνο κλήρωσης και τα Έπαθλα αυτής (πέραν των όσων ήδη αναφέρονται σχετικά στο παρόν) θα παρέχονται από τoν παρουσιαστή της Εκπομπής κατά τη διάρκεια της μετάδοσής των επεισοδίων της στο πλαίσιο των οποίων θα διεξάγεται κάθε αντίστοιχη Προωθητική Ενέργεια.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Δικαίωμα συμμετοχής στις Προωθητικές Ενέργειες έχουν όλοι οι χρήστες υπηρεσιών κινητής ή/και σταθερής τηλεφωνίας, μόνο εφόσον διαμένουν στην Ελλάδα, είναι άνω των 18 ετών, είναι κάτοχοι του τηλεφωνικού αριθμού ή έχουν την έγγραφη συναίνεση του κατόχου του τηλεφωνικού αριθμού μέσω του οποίου συμμετέχουν στις Προωθητικές Ενέργειες και έχουν πλήρη δικαιοπρακτική ικανότητα, όπως αυτή ορίζεται στις σχετικές νομοθετικές διατάξεις και αποδέχονται ανεπιφύλακτα τους παρόντες Όρους και όλες τις αποφάσεις και ανακοινώσεις της Διοργανώτριας, για την εκάστοτε Προωθητική Ενέργεια, οι οποίες είναι οριστικές, δεσμευτικές και απρόσβλητες. Δεν έχουν δικαίωμα συμμετοχής στις Προωθητικές Ενέργειες το προσωπικό της Διοργανώτριας και του Παρόχου, οι σύζυγοι καθώς και οι συγγενείς των ανωτέρω μέχρι και β&#39; βαθμού (σε ευθεία γραμμή ή εκ πλαγίου).\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Για να θεωρηθεί ότι κάποιος δηλώνει συμμετοχή στην Προωθητική Ενέργεια (εφεξής ο «Συμμετέχων»), θα πρέπει, κατά την αναφερόμενη διάρκεια της Προωθητικής Ενέργειας (και ειδικότερα αναφερόμενα ανά τρόπο συμμετοχής), να καλέσει (από σταθερό ή κινητό τηλέφωνο εντός Ελλάδος) ή να στείλει SMS (από κινητό τηλέφωνο εντός Ελλάδος) στον αριθμό υψηλής χρέωσης 14614, με χρέωση 3,14 ευρώ/κλήση από σταθερό ή 3,29 ευρώ/κλήση από κινητό και 3,29 ευρώ/sms (συμπεριλαμβανομένου Φ.Π.Α και τέλους συνδρομητών σταθερής και κινητής τηλεφωνίας αντίστοιχα).\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Ειδικότερα ορίζονται τα εξής:\n (i) Κάθε Συμμετέχων μέσω κλήσης, καλώντας στον αριθμό 14614, συνδέεται με το αυτόματο σύστημα διαχείρισης κλήσεων του Παρόχου, όπου μέσω ηχητικού μηνύματος ενημερώνεται για: α) τη χρέωση της κλήσης του, β) την επιβεβαίωση συμμετοχής του στην Προωθητική Ενέργεια, γ) τον μοναδικό κωδικό αριθμό (Δωροεπιταγή), ίσης ή μεγαλύτερης αξίας με το κόστος της κλήσης, (ο οποίος ανακοινώνεται δύο φορές) και τον οποίο θα μπορεί να εξαργυρώσει σε υπηρεσίες ή προϊόντα (ίσης ή μεγαλύτερης αξίας, χωρίς να υποχρεούται να καταβάλλει την τυχόν διαφορά) από τον διαδικτυακό τόπο www.winnow.gr. Σημειώνεται ότι, οι Συμμετέχοντες μπορούν να λάβουν από τον Πάροχο τον ως άνω μοναδικό κωδικό, κατόπιν επικοινωνίας (στην τηλεφωνική γραμμή υποστήριξης 2109472166), εάν τυχόν αυτό δεν κατέστη δυνατό κατά τη διάρκεια της κλήσης, μόνο όμως εφόσον δεν έχουν καλέσει με απόκρυψη του αριθμού συνδρομητή. O Συμμετέχων μέσω φωνητικής κλήσης, πρέπει να εκφωνήσει/ηχογραφήσει τον αριθμό τηλεφώνου και το ονοματεπώνυμό του. Κάθε τηλεθεατής μπορεί να καλέσει περισσότερες από μία φορές για να δηλώσει αντίστοιχες συμμετοχές, ωστόσο κάθε φορά που καλεί, θα λαμβάνει νέο κωδικό αριθμό, που θα μπορεί να εξαργυρώσει σε υπηρεσίες ή προϊόντα (ίσης ή μεγαλύτερης αξίας με το κόστος της κλήσης, χωρίς να υποχρεούται να καταβάλλει την τυχόν διαφορά) από τον διαδικτυακό τόπο www.winnow.gr. Η χρήση του κωδικού υπόκειται στους αναφερόμενους κατωτέρω, στο κεφάλαιο Ε του παρόντος, όρους. (ii) Κάθε Συμμετέχων μέσω γραπτού μηνύματος SMS, πρέπει να πληκτρολογήσει την εντολή ΚΕ (κενό) και το ονοματεπώνυμό του και να αποστείλει τον SMS στον αριθμό 14614. Στη συνέχεια, ο Συμμετέχων θα λαμβάνει δωρεάν γραπτό μήνυμα SMS με το οποίο θα ενημερώνεται για α) τη χρέωση μηνύματος για τη συμμετοχή του, β) την επιβεβαίωση συμμετοχής του στην Προωθητική Ενέργεια, γ) τον μοναδικό κωδικό αριθμό (Δωροεπιταγή) και τον οποίο θα μπορεί να εξαργυρώσει σε υπηρεσίες ή προϊόντα (ίσης ή μεγαλύτερης αξίας με το κόστος της κλήσης, χωρίς να υποχρεούται να καταβάλει την τυχόν διαφορά) από τον διαδικτυακό τόπο www.winnow.gr και δ) την τοποθεσία ανάρτησης των όρων και προϋποθέσεων. Η χρήση του κωδικού υπόκειται στους αναφερόμενους κατωτέρω, στο κεφάλαιο Ε του παρόντος, όρους.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Η προσήκουσα συμμετοχή σε Προωθητική Ενέργεια της Εκπομπής συνεπάγεται την απόδοση, σε κάθε προσηκόντως συμμετέχοντα- χρήστη και για κάθε κλήση του/μήνυμά του, ενός κωδικού (δωροεπιταγής) ίσης ή μεγαλύτερης αξίας με το κόστος της κλήσης/μηνύματος μέσω του οποίου συμμετέχει, καθώς και τη συμμετοχή του στην διεκδίκηση του εκάστοτε χρηματικού ή μη επάθλου (στο εξής το «Έπαθλο»), που θα κερδίζεται κατόπιν κλήρωσης, μετά το πέρας της προκηρυχθείσας διάρκειας κάθε Προωθητικής Ενέργειας, σύμφωνα με τα οριζόμενα στους παρόντες όρους.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Κάθε Συμμετέχων μπορεί να δηλώνει συμμετοχή, κάνοντας χρήση της ανωτέρω υπό α ή/και β Υπηρεσίας, δηλαδή καλώντας τηλεφωνικά κατά τον ανωτέρω υπό α τρόπο ή/και στέλνοντας SMS κατά τον υπό β τρόπο, περισσότερες από μία φορές στο πλαίσιο της κάθε Προωθητικής Ενέργειας. Κάθε φορά δε που κάνει χρήση Υπηρεσίας, θα ενημερώνεται ως άνω για τον αντίστοιχο μοναδικό κωδικό (δωροεπιταγή). Συνεπώς κάθε Συμμετέχων μπορεί να προβαίνει σε περισσότερες της μίας (1) δηλώσεις συμμετοχής (χωρίς περιορισμό) και με συνδυαστικό τρόπο (δηλαδή μέσω κλήσης και γραπτού μηνύματος ως άνω), λαμβάνοντας κάθε φορά νέο (μοναδικό) κωδικό αριθμό, που θα μπορεί να εξαργυρώσει σε υπηρεσίες ή προϊόντα (ίσης ή μεγαλύτερης αξίας, χωρίς να υποχρεούται να καταβάλλει την τυχόν διαφορά) από τον διαδικτυακό τόπο www.winnow.gr. Η χρήση του κωδικού υπόκειται στους αναφερόμενους κατωτέρω, στο κεφάλαιο Ε του παρόντος.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Στην τηλεοπτική κάρτα που εμφανίζεται ο αριθμός 14614, παρέχεται αναλυτική πληροφόρηση για την τηλεφωνική γραμμή υποστήριξης της υπηρεσίας, τις χρεώσεις, καθώς και τον Πάροχο, όπως προβλέπεται από τους Κανονισμούς της ΕΕΤΤ.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                'Γ. Διαδικασία ανάδειξης νικητών- Έπαθλα:',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 18),
              ),
              Text(
                '''Τα στοιχεία των Συμμετεχόντων καταχωρούνται στα συστήματα του Παρόχου και κατά τη λήξη της εκάστοτε Προωθητικής Ενέργειας (και στο χρόνο που κάθε φορά θα ανακοινώνεται από τον παρουσιαστή), θα διεξάγεται από τους προστηθέντες του Παρόχου ηλεκτρονική κλήρωση, στη βάση όλων των Συμμετεχόντων, που κάλεσαν/έστειλαν μήνυμα με σκοπό την ανάδειξη ενός ή περισσότερων νικητών (αναλόγως των όρων κάθε Προωθητικής Ενέργειας, όπως θα έχουν ανακοινωθεί από τον παρουσιαστή της Εκπομπής και του αριθμού των Επάθλων), που θα κερδίζουν τα αντίστοιχα Έπαθλα, καθώς και ενός ή περισσότερων αναπληρωματικών των νικητών, στην περίπτωση που οι αρχικώς αναδειχθέντες νικητές ή κάποιοι εξ’ αυτών δεν προσέλθουν για την παραλαβή του επάθλου τους ή αρνηθούν την παραλαβή του ή διαπιστωθεί ότι η συμμετοχή τους δεν είναι έγκυρη ή σε περίπτωση αδυναμίας εξεύρεσής τους εντός (20) εργάσιμων ημερών από την ημερομηνία της κλήρωσης, σύμφωνα με τους όρους του παρόντος. Η ηλεκτρονική κλήρωση, θα γίνεται με τη μέθοδο αλγορίθμου, από πιστοποιημένη γεννήτρια και θα διεξάγεται σύμφωνα με προβλεπόμενα στους παρόντες όρους.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Κατά τη λήξη διεξαγωγής της εκάστοτε Προωθητικής Ενέργειας (όπως θα έχει ανακοινωθεί από τον παρουσιαστή της εκπομπής) σταματάει και η δυνατότητα δήλωσης συμμετοχής για την συγκεκριμένη Ενέργεια και ως εκ τούτου, δεν θα γίνονται δεκτές εκπρόθεσμες δηλώσεις συμμετοχής. Στη συνέχεια θα ενημερώνεται τηλεφωνικά και μέσω SMS (εφόσον έχει συμμετάσχει μέσω κινητού τηλεφώνου) ο εκάστοτε νικητής από τους υπεύθυνους του Παρόχου στον αριθμό, απ’ όπου έχει δηλώσει τη συμμετοχή του και θα ενημερώνεται για την παραλαβή του σχετικού Επάθλου. Η δημοσιοποίηση των στοιχείων του αναδειχθέντος νικητή, προς διαφύλαξη του αδιάβλητου της διαδικασίας, θα γίνεται από την παραγωγή κατά τη διάρκεια του επεισοδίου της Εκπομπής στη διάρκεια του οποίου θα γίνεται η κλήρωση, με σχετική παράλληλη καταχώρηση του ονόματός του και στην ιστοσελίδα της Διοργανώτριας. Οι τηλεθεατές, οι Συμμετέχοντες και γενικά κάθε ενδιαφερόμενος μπορούν να απευθύνονται στη γραμμή υποστήριξης αστικής χρέωσης 2109472166 για ζητήματα που αφορούν τις Προωθητικές Ενέργειες, όπως ερωτήσεις, διευκρινίσεις ή/και πληροφορίες.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                'Δ. Λόγοι ακύρωσης νικητή',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 18),
              ),
              Text(
                '''Κάθε νικητής μπορεί να ακυρωθεί και να χάσει το έπαθλο:\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''1. Όταν η ηχογράφηση ή το γραπτό μήνυμα (sms) της συμμετοχής του, δεν περιλαμβάνει όλα τα απαιτούμενα στοιχεία (ονοματεπώνυμο &amp; τηλέφωνο για την ηχογράφηση και ονοματεπώνυμο για το γραπτό μήνυμα ) ή το περιεχόμενο της ηχογράφησης ή του γραπτού μηνύματος (sms) είναι κενό, ανακριβές ή ακατανόητο, άρα δεν είναι προσήκουσα η συμμετοχή του.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''2. Στην περίπτωση που δεν καταστεί δυνατή η επικοινωνία με τον εκάστοτε νικητή στον τηλεφωνικό αριθμό που ο ίδιος έχει δώσει στους προστηθέντες του Παρόχου, εντός της προκαθορισμένης προθεσμίας των είκοσι (20) εργάσιμων ημερών από την προβολή του επεισοδίου της κλήρωσης για την εν λόγω Προωθητική Ενέργεια, σύμφωνα με τους παρόντες όρους.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''3. Στην περίπτωση που ο νικητής δεν έχει αποστείλει (βάσει της ημερομηνίας της σφραγίδας του ταχυδρομείου ή της απόδειξης courier), εντός (20) ημερών από την ημερομηνία ενημέρωσής τους, όλα τα απαιτούμενα ως άνω δικαιολογητικά.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''4. Σε περίπτωση που εντός (20) ημερών από την ημερομηνία ενημέρωσής τους, δεν ολοκληρωθεί η ως άνω περιγραφόμενη διαδικασία παράδοσης επάθλου με δική του υπαιτιότητα.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''5. Στην περίπτωση που αρνηθεί να καταβάλλει τους αναλογούντες φόρους της εφορίας, όπως ορίζεται από τον νομό 2961/2001 (Άρθρο 58, παράγραφος 1 περίπτωση ε & Άρθρο 60, παράγραφος 3.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                'Ε. Χρήση Κωδικού/Δωροεπιταγής',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 18),
              ),
              Text(
                '''Προκειμένου να κάνει χρήση του σχετικού Κωδικού Αριθμού winnow, ο Συμμετέχων θα πρέπει να εισάγει κάθε φορά τον μοναδικό κωδικό στην ηλεκτρονική σελίδα www.winnow.gr, εξαργυρώνοντάς τον σε ένα προϊόν ή μια υπηρεσία της επιλογής του.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Η συγκεκριμένη ιστοσελίδα προσφέρει προϊόντα και υπηρεσίες διαφόρων κατηγοριών, οι οποίες είναι χρήσιμες για το σύνολο των Συμμετεχόντων στην Προωθητική Ενέργεια, δίνοντας τους τη δυνατότητα της επιλογής.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Οι προσφερόμενες παροχές (προϊόντα ή υπηρεσίες) στους Συμμετέχοντες είναι πάντα ίσης ή μεγαλύτερης αξίας του κόστους -κατά τα ανωτέρω- συμμετοχής τους στην Προωθητική Ενέργεια. Κάθε κωδικός μπορεί να χρησιμοποιηθεί μόνο μία (1) φορά. Ο κωδικός δεν δύναται να εξαργυρωθεί σε χρήματα. Όλοι οι κωδικοί εξαργυρώνονται μεμονωμένα, για διαφορετικές αγορές και δεν παρέχεται η δυνατότητα να εξαργυρωθούν σωρευτικά. Ο δικαιούχος δύναται να επιλέξει προϊόντα μεγαλύτερης αξίας από το κόστος της συμμετοχής του, χωρίς όμως να υποχρεούται να καταβάλλει την -τυχόν- διαφορά.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Κάθε Συμμετέχων, δύναται να αποκτήσει και να χρησιμοποιήσει απεριόριστο αριθμό Κωδικών Αριθμών winnow, αντίστοιχων των δηλώσεων συμμετοχής του. Σε κάθε περίπτωση, η αποστολή των προϊόντων προς τους δικαιούχους, πραγματοποιείται από εταιρεία ταχυμεταφορών ή τους προστηθέντες/συνεργάτες της ηλεκτρονικής σελίδας www.winnow.gr, στη διεύθυνση που θα δηλώσει ο δικαιούχος, χωρίς να επιβαρυνθεί ο ίδιος με τα έξοδα αποστολής. Η χρήση κάθε κωδικού μπορεί να γίνει αποκλειστικά και μόνο εντός χρονικού διαστήματος ενός (1) μήνα από την επομένη της ημέρας λήψης του σχετικού κωδικού, μετά δε το πέρας του διαστήματος αυτού, ο κωδικός ακυρώνεται και παύει να ισχύει. Η χορήγηση του κατά τα ως άνω κωδικού και η χρήση του από τον Συμμετέχοντα είναι ανεξάρτητη του εάν αυτός κληρωθεί ή όχι ως Νικητής του Επάθλου της Προωθητικής Ενέργειας (ή/και τυχερός τυχόν Πρόσθετων Κληρώσεων).\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Οι Συμμετέχοντες μπορούν να λάβουν από τον Πάροχο τον κωδικό, κατόπιν επικοινωνίας στον τηλεφωνικό αριθμό 2109472166, εφόσον αυτό δεν κατέστη δυνατό κατά τη διάρκεια της κλήσης και εφόσον δεν έχουν καλέσει με απόκρυψη του αριθμού συνδρομητή.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                'ΣΤ. Ενημέρωση νικητών - Προϋποθέσεις παράδοσης επάθλου',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 18),
              ),
              Text(
                '''Η Εταιρεία («ΕΙΔΗΣΕΟΦΩΝΙΚΗ ΕΛΛΑΣ Α.Ε.Ε.») είναι υπεύθυνη για την καταβολή/παράδοση των χρηματικών και μη χρηματικών (σε είδος) επάθλων στους νικητές, τα οποία θα αποδίδονται ύστερα από σχετική ενημέρωσή τους, ως ακολούθως:\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Η απόδοση (καταβολή) των χρηματικών επάθλων θα λαμβάνει χώρα ως εξής: Οι προστηθέντες του Παρόχου θα ενημερώνουν τηλεφωνικά και μέσω SMS (εφόσον έχουν συμμετάσχει μέσω κινητού τηλεφώνου) τους νικητές για τα απαιτούμενα δικαιολογητικά, που πρέπει να προσκομίσουν, ώστε να τους αποδοθούν τα χρηματικά ή άλλα έπαθλα. Συγκεκριμένα, εντός πέντε (5) εργάσιμων ημερών από την διεξαγωγή της κλήρωσης, ο Πάροχος θα πραγματοποιεί επικοινωνία με τους νικητές στον τηλεφωνικό αριθμό, που οι ίδιοι έχουν δώσει (ή απ’ όπου έχουν δηλώσει συμμετοχή μέσω μηνύματος), ώστε να τους ενημερώσει για τον τρόπο κάρπωσης του επάθλου.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Κατά την επικοινωνία αυτή θα ζητούνται από τους νικητές τα πλήρη στοιχεία τους για την δυνατότητα εξακρίβωσης της ταυτοπροσωπίας κατά την παράδοση των σχετικών επάθλων και συγκεκριμένα, αριθμός ταυτότητας, ΑΦΜ, Δ.Ο.Υ και διεύθυνση κατοικίας. Σε περίπτωση που κατά το χρονικό διάστημα των είκοσι (20) εργάσιμων ημερών από την προβολή του επεισοδίου της Εκπομπής όπου έγινε η κλήρωση για την εν λόγω Προωθητική Ενέργεια δεν έχει καταστεί δυνατή η επικοινωνία με τους νικητές (παρ’ ότι αποδεδειγμένα οι προστηθέντες του Παρόχου θα έχουν προσπαθήσει να επικοινωνήσουν ως ανωτέρω), αυτοί χάνουν το σχετικό έπαθλο.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Οι νικητές θα πρέπει εντός είκοσι (20) ημερών από την ημερομηνία ενημέρωσής τους, κατά τα ανωτέρω, να αποστείλουν στα γραφεία του Παρόχου (στην ανωτέρω διεύθυνση), τα εξής δικαιολογητικά: 1. Επικυρωμένη φωτοτυπία της αστυνομικής τους ταυτότητας ή του διαβατηρίου τους, από αστυνομικό τμήμα ή από ΚΕΠ. 2. Υπεύθυνη δήλωση με βεβαίωση του γνησίου υπογραφής από αστυνομικό τμήμα / ΚΕΠ ή μέσω της ψηφιακής πύλης gov.gr, όπου θα δηλώνουν (α) λογαριασμό τραπέζης (IBAN) και πιστωτικό ίδρυμα (εντός Ελλάδος) για την εκ μέρους του Παρόχου καταβολή του Επάθλου και το Α.Φ.Μ και τη Δ.Ο.Υ. στην οποία ανήκουν, καθώς και (β) ότι αποδέχονται το έπαθλο και τους όρους &amp; προϋποθέσεις της Προωθητικής Ενέργειας της Εκπομπής.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Το χρηματικό έπαθλο θα καταβάλλεται στους Νικητές (με μεταφορά στον λογαριασμό τους) εντός εξήντα (60) ημερών από την επομένη της παραλαβής από τον Πάροχο των απαιτούμενων δικαιολογητικών κατά τα ανωτέρω. Διευκρινίζεται ότι σε κάθε περίπτωση ο φόρος που επιβάλλεται από το Ελληνικό Κράτος με βάση τον νόμο 2961 / 2001 (Άρθρο 58 παράγραφος 1 περίπτωση ε &amp; Άρθρο 60 παράγραφος 3) σε έπαθλα άνω των 1000€ βαραίνει τον νικητή του επάθλου και είναι 20% ή ως εκάστοτε ορίζεται εκ του νόμου (παρακρατείται συνεπώς από το ποσό του επάθλου).\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Η παράδοση των μη χρηματικών επάθλων, γίνεται ως εξής: Οι προστηθέντες του Παρόχου ενημερώνουν τηλεφωνικά και μέσω SMS (εφόσον έχουν συμμετάσχει μέσω κινητού τηλεφώνου) τους νικητές για τα απαιτούμενα δικαιολογητικά, που πρέπει να προσκομίσουν ώστε να τους αποδοθούν τα έπαθλα. Συγκεκριμένα, εντός είκοσι (20) εργάσιμων ημερών από την ημερομηνία προβολής του επεισοδίου της Εκπομπής όπου έλαβε χώρα η κλήρωση αναφορικά με την εν λόγω Προωθητική Ενέργεια, θα πραγματοποιεί επικοινωνία με τους νικητές στον τηλεφωνικό αριθμό, που οι ίδιοι έχουν δώσει (ή απ’ όπου έχουν δηλώσει συμμετοχή μέσω μηνύματος), ώστε να ενημερωθούν για τον τρόπο παραλαβής του εκάστοτε Επάθλου. Κατά την επικοινωνία αυτή θα ζητούνται από τους νικητές τα πλήρη στοιχεία τους για την δυνατότητα εξακρίβωσης της ταυτοπροσωπίας κατά την παράδοση των χορηγικών/δωροθετικών επάθλων. Σε περίπτωση που κατά το χρονικό διάστημα των είκοσι (20) εργάσιμων ημερών από την προβολή του επεισοδίου της Εκπομπής όπου έλαβε χώρα η κλήρωση δεν έχει (αποδεδειγμένα) καταστεί δυνατή η επικοινωνία με τους νικητές, αυτοί χάνουν τα εν λόγω έπαθλα.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Διευκρινίζεται ότι σε κάθε περίπτωση ο φόρος που επιβάλλεται από το Ελληνικό Κράτος με βάση τον νόμο 2961/2001 (Άρθρο 58 παράγραφος 1 περίπτωση ε &amp; Άρθρο 60 παράγραφος 3) σε έπαθλα άνω των 1000€ βαραίνει τον νικητή του επάθλου, και είναι 20% (ή ως εκάστοτε ορίζεται από τον νόμο). Επίσης και όποια έξοδα απαιτούνται για την αξιοποίηση τυχόν δώρων (π.χ. έξοδα για την μεταβίβαση αδείας, τέλη κυκλοφορίας και πινακίδων τροχοφόρου κ.λπ.), βαρύνουν και πάλι τους νικητές. Ρητά διευκρινίζεται ότι, την ευθύνη της απόδοσης όλων γενικά των επάθλων -χρηματικών και μη χρηματικών επάθλων, φέρει αποκλειστικά ο Πάροχος (κατά τους όρους της συμφωνίας της με τη Διοργανώτρια) ο οποίος θα διεκπεραιώνει και όλη τη διαδικασία, επιμέλεια και ευθύνη απόδοσης αυτών στους νικητές.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Κάθε νικητής, με τη δήλωση συμμετοχής του στην Προωθητική Ενέργεια και αποδεχόμενος του παρόντες όρους, συναινεί ανεπιφύλακτα στην ανακοίνωση και παρουσίαση του ιδίου, του ονόματός του, της εικόνας του (μέσω σύντομου βίντεο/ πλάνων) στο κοινό, μέσω του Σταθμού ή άλλως, ως νικητή της Προωθητική Ενέργειας, χωρίς την καταβολή οιασδήποτε αμοιβής για τον λόγο αυτό και στη συμμετοχή του στην βιντεοσκόπηση της διαδικασίας παράδοσης/ απόδοσης σε αυτόν του εκάστοτε επάθλου.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                'Ζ. Λοιποί όροι',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 18),
              ),
              Text(
                '''-Όλα τα έπαθλα είναι προσωπικά και δεν ανταλλάσσονται ούτε δύναται να ζητηθεί η αντικατάστασή τους με άλλα ή η μετατροπή τους σε χρήματα . Η Διοργανώτρια και ο Πάροχος δεν ευθύνονται για συμμετοχές που ενδεχομένως έχουν λάθος στοιχεία ή είναι ελλιπείς.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''-Ρητά αναφέρεται ότι, οποιαδήποτε έξοδα απαιτούνται για την παραλαβή του Επάθλου ή οποιαδήποτε έξοδα απαιτούνται για την αξιοποίηση αυτού (π.χ. έξοδα για την μεταβίβαση αδείας, τέλη κυκλοφορίας και πινακίδων τροχοφόρου κ.λπ.), καθώς επίσης και τυχόν νόμιμοι φόροι ή κρατήσεις υπέρ τρίτων ή άλλα τέλη επιβαρύνουν αποκλειστικά και εξ ολοκλήρου τον νικητή. Σε περίπτωση μη τήρησης των όρων αναδείξεως του εκάστοτε Συμμετέχοντα ως νικητή ή εν γένει των όρων του παρόντος ή αποποίησης του επάθλου, ο Πάροχος έχει το δικαίωμα να αρνηθεί την απόδοσή του, οπότε αυτό θα διατεθεί στους αναπληρωματικούς των νικητών που θα κληρώνονται κάθε φορά (αναλόγως των όρων κάθε Προωθητικής Ενέργειας, όπως θα έχουν ανακοινωθεί από τον παρουσιαστή της Εκπομπής και του αριθμού των νικητών και Επάθλων).\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''-Μετά την εκπνοή της διάρκειας κάθε Προωθητικής Ενέργειας και την απόδοση των Επάθλων, κάθε υποχρέωση της Διοργανώτριας και του Παρόχου παύει να υφίσταται, μη υπέχουσας οποιασδήποτε υποχρέωσης ή ευθύνης έναντι των Συμμετεχόντων και των νικητών (πέραν των οριζόμενων σχετικά με τα προσωπικά δεδομένα τους κατωτέρω). Η Διοργανώτρια ή/και ο Πάροχος δεν φέρει καμία ευθύνη ποινική ή αστική προς τους νικητές ή τρίτους, για οποιοδήποτε ατύχημα ή/και ζημία ή/και για οποιαδήποτε σωματική ή άλλη βλάβη ήθελε προκληθεί σε αυτούς σχετιζόμενη άμεσα ή έμμεσα με το Έπαθλο ή/και τη χρήση αυτού ή/και για οποιαδήποτε άλλη αιτία.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''-Οι παρόντες Όροι διεξαγωγής Προωθητικών Ενεργειών στο πλαίσιο της Εκπομπής θα παραμένουν αναρτημένοι στην ιστοσελίδα της Διοργανώτριας, www.antenna.gr καθ’ όλη τη διάρκεια αυτών. Κάθε επιπλέον ανακοίνωση με οδηγίες, όρους ή/και τροποποιήσεις σχετικά με τους παρόντες όρους για την συμμετοχή στις Προωθητικές Ενέργειες της Εκπομπής ή/και την κάρπωση των επάθλων, η οποία θα αναρτηθεί από τη Διοργανώτρια κατά τα ανωτέρω ή/και ανακοινωθεί μέσω της Εκπομπής ή/και δημοσιευθεί με οποιοδήποτε άλλο τρόπο, αποτελεί αναπόσπαστο τμήμα των παρόντων όρων.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''-Η Διοργανώτρια διατηρεί το δικαίωμα, ανά πάσα στιγμή, μονομερώς να διακόψει ή να ακυρώσει ή να ματαιώσει ή να αναβάλει κάποια Προωθητική Ενέργεια, οποτεδήποτε, καθώς και να τροποποιεί μέρη των παρόντων όρων καθώς και τους εκάστοτε όρους και διαδικασίες εκάστοτε Προωθητικής Ενέργειας (λ.χ. διάρκεια, χρόνο κλήρωσης, έπαθλα κ.λπ.), ενημερώνοντας σχετικά τους Συμμετέχοντες με τον πλέον πρόσφορο τρόπο (ακόμη όμως και προφορικά μέσω του παρουσιαστή, στο πλαίσιο επεισοδίου της Εκπομπής) και με την ανάρτηση νεότερου εγγράφου στην ανωτέρω ιστοσελίδα, απαλλασσόμενοι από οποιαδήποτε ευθύνη, οι δε Συμμετέχοντες αποδέχονται από τώρα τα ανωτέρω, μόνο με τη συμμετοχή τους σε Προωθητική Ενέργεια και την αποδοχή των όρων του παρόντος.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''-Αναφορικά με τυχόν έπαθλο – αυτοκίνητο: Λόγω των ειδικών συνθηκών που έχουν διαμορφωθεί διεθνώς λόγω της πανδημίας του COVID 19, παρατηρούνται σημαντικές καθυστερήσεις στις εισαγωγές οχημάτων στην Ελλάδα. Ως εκ τούτου η ημερομηνία απόδοσης του επάθλου (οχήματος) της Ενέργειας καθώς και το χρώμα αυτού, θα εξαρτώνται από τη διαθεσιμότητα της εισαγωγικής εταιρίας, (αντιπροσώπου), ή/και του εργοστασίου κατασκευής. Οι Συμμετέχοντες στις Προωθητικές ενέργειες όπου έπαθλο ενδεχομένως είναι αυτοκίνητο καθώς και οι νικητές, με μόνη τη συμμετοχή τους, αποδέχονται συνολικά τους παρόντες όρους συμπεριλαμβανομένης της ενδεχόμενης καθυστέρησης της παράδοσης του οχήματος ή/και αλλαγής του διαθέσιμου χρώματος. Η ενδεχόμενη αυτή καθυστέρηση ή/και αλλαγή χρώματος του επάθλου (οχήματος) σε καμία περίπτωση δε θα αποτελεί ευθύνη της Διοργανώτριας ή του Παρόχου και δε θα δημιουργεί ουδεμία αξίωση αποζημίωσης στον εκάστοτε δικαιούχο του επάθλου (νικητή).\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''-Οι Συμμετέχοντες αναγνωρίζουν και αποδέχονται ότι Προωθητική Ενέργεια ενδέχεται να επηρεαστεί ή διακοπεί προσωρινά λόγω προβλημάτων του δικτύου ή των παροχών σταθερής &amp; κινητής τηλεφωνίας ή σε περίπτωση τεχνικών προβλημάτων κατά τη διάρκεια χρήσης της υπηρεσίας, που είτε οφείλεται σε απρόβλεπτη βλάβη του εξοπλισμού του Παρόχου (ανωτέρα βία) είτε οφείλονται σε βλάβες ή αδυναμίες τηλεπικοινωνιακών δικτύων ή τεχνικού εξοπλισμού και λογισμικού για τα οποία ουδεμία ευθύνη φέρουν η Διοργανώτρια και ο Πάροχος.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''-Θα καταβάλλεται κάθε προσπάθεια να επιλυθεί συμβιβαστικά κάθε διαφορά ή απαίτηση που τυχόν προκύψει σε σχέση με την προωθητική ενέργεια της εκπομπής. Θέματα σχετικά με την εφαρμογή, ερμηνεία, ακυρότητα των παρόντων όρων, ερμηνεύονται σύμφωνα με το Ελληνικό Δίκαιο και υπάγονται στην αποκλειστική δικαιοδοσία των καθ’ ύλην αρμοδίων δικαστηρίων της πόλεως των Αθηνών.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                'Η. Προσωπικά Δεδομένα:',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 18),
              ),
              Text(
                '''Η υλοποίηση του Προγράμματος απαιτεί τη δημιουργία αρχείου δεδομένων προσωπικού χαρακτήρα, το οποίο θα συμπεριλαμβάνει τα ονόματα των Συμμετεχόντων, καθώς και τα λοιπά αναφερόμενα στο πλαίσιο των παρόντων όρων στοιχεία που συνιστούν προσωπικά τους δεδομένα και είναι τα ελάχιστα απαιτούμενα για τη διενέργεια της Προωθητικής Ενέργειας. Για αυτόν τον λόγο μόνη η δήλωση συμμετοχής σε οιαδήποτε Προωθητική Ενέργεια στο πλαίσιο του παρόντος, συνεπάγεται την ανεπιφύλακτη παροχή της ελεύθερης ρητής και ανεπιφύλακτης συναίνεσης κάθε Συμμετέχοντα προς την Διοργανώτρια και τον Πάροχο, προκειμένου να καταχωρηθεί το ονοματεπώνυμό του (και τα λοιπά ως άνω ελάχιστα στοιχεία του κατά τα ανωτέρω αναφερόμενα) σε αρχείο που θα δημιουργηθεί (και τηρηθεί) για όσο χρόνο διαρκεί η Προωθητική Ενέργεια και για έξι (6) μήνες μετά τη λήξης της (κλήρωση) από την Διοργανώτρια και τον Πάροχο, σύμφωνα με τον Γενικό Ευρωπαϊκό Κανονισμό για την Προστασία των Δεδομένων Προσωπικού Χαρακτήρα, τον ν. 4624/2019, καθώς και τις Αποφάσεις και Οδηγίες της Αρχής Προστασίας Δεδομένων Προσωπικού Χαρακτήρα.\nΚάθε συμμετέχων δύναται ωστόσο να ανακαλέσει ανά πάσα στιγμή και με εύκολη διαδικασία την ανωτέρω συναίνεσή του. Σκοπός της εκ μέρους του Παρόχου, τήρησης του αρχείου αυτού και επεξεργασίας στοιχείων του είναι αποκλειστικά η διεξαγωγή και υλοποίηση του Διαγωνισμού και η ταυτοποίηση του νικητή προς το σκοπό απόδοσης σε αυτόν του επάθλου. Η Διοργανώτρια και ο Πάροχος έχουν λάβει όλα τα κατάλληλα τεχνικά και οργανωτικά μέτρα για την προστασία των ως άνω προσωπικών δεδομένων σας, τα οποία θα χρησιμοποιηθούν αποκλειστικά για τους παραπάνω σκοπούς επεξεργασίας. Τα προσωπικά σας δεδομένα δεν θα καταστούν προσιτά και δεν θα τύχουν γενικά οποιασδήποτε επεξεργασίας από τρίτα μη εξουσιοδοτημένα πρόσωπα, πλην αυτών που αρμοδίως εμπλέκονται στην υλοποίηση της παρούσας Προωθητικής Ενέργειας. Η επεξεργασία των δεδομένων προσωπικού χαρακτήρα σας θα λάβει χώρα αυστηρά για όσο χρονικό διάστημα θεωρείται απολύτως απαραίτητο για την επίτευξη των ανωτέρω σκοπών επεξεργασίας, ήτοι για όσο χρόνο διαρκεί η παρούσα Προωθητική Ενέργεια και η απόδοση του επάθλου στον νικητή.\n Σε κάθε περίπτωση, το αργότερο μετά την πάροδο τουλάχιστον έξι (6) μηνών από τη λήξη της εκάστοτε Προωθητικής Ενέργειας, κατά τα οριζόμενα στους παρόντες Όρους, τα σχετικά στοιχεία θα διαγράφονται/ καταστρέφονται, εκτός αν συντρέχει νόμιμος λόγος περαιτέρω επεξεργασίας αυτών. Μπορείτε να ασκήσετε, τα δικαιώματά σας, που απορρέουν από τον Γενικό Κανονισμό Προστασίας Δεδομένων (Κανονισμός (ΕΕ) 2016/679) και τον ν. 4624/2019: α. Δικαίωμα ενημέρωσης (άρθρα13-14) β. Δικαίωμα πρόσβασης (άρθρο 15), γ. Δικαίωμα διόρθωσης (άρθρο 16), δ. Δικαίωμα διαγραφής (άρθρο 17), ε. Δικαίωμα περιορισμού της επεξεργασίας (άρθρο 18) στ. Δικαίωμα στη φορητότητα των δεδομένων - άρθρο 20) και ζ. Δικαίωμα εναντίωσης (άρθρο 21).\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Κάθε συμμετέχων διατηρεί το δικαίωμα πρόσβασης, διαγραφής ή/και αντίρρησης στην επεξεργασία των στοιχείων του από τον Πάροχο, (κατά τις διατάξεις του παραπάνω Γενικού Ευρωπαϊκού Κανονισμού (EU GDPR), επικοινωνώντας με την Διοργανώτρια στο e-mail dataprotection@antenna.gr, καθώς και με επιστολή στη διεύθυνση Κηφισίας 10-12, Μαρούσι (15125) και με τον Πάροχο, στo τηλέφωνο 2109472166 ή στο e-mail privacy@newsphone.gr, καθώς και με επιστολή στην ως άνω διεύθυνση του Παρόχου.\nΗ συμμετοχή στην προωθητική ενέργεια αποτελεί ρητή δήλωση συγκατάθεσης του συμμετέχοντα, η οποία μπορεί να ανακληθεί οποτεδήποτε στo τηλέφωνο 2109472166 ή στα άνω e-mails καθώς και με επιστολή στις ως άνω διευθύνσεις, χωρίς αναδρομικό αποτέλεσμα και χωρίς να μπορεί να αμφισβητηθεί η συμμετοχή, ως ενέργεια που προέρχεται από τον συμμετέχοντα. Προς τον σκοπό αυτό, ο Πάροχος, μπορεί να διατηρεί σε αρχείο, όλες τις δηλώσεις ανάκλησης της συγκατάθεσης.\nΟ Πάροχος δεσμεύεται να μην αποκαλύψει τα προσωπικά αυτά δεδομένα των συμμετεχόντων σε τρίτους, με εξαίρεση όσους ενδεχομένως συνεργαστούν μαζί της/προστηθέντες της στο πλαίσιο διεξαγωγής των Προωθητικών Ενεργειών. Σε κάθε περίπτωση, εφόσον θεωρείτε, ότι έχει παραβιαστεί η προστασία των προσωπικών σας δεδομένων με οποιονδήποτε τρόπο, έχετε το δικαίωμα να υποβάλετε καταγγελία στην Ελληνική Αρχή Προστασίας Δεδομένων Προσωπικού Χαρακτήρα (www.dpa.gr), Λεωφόρος Κηφισίας 1-3, Τ.Κ 11523-Αθήνα, τηλ. 2106475600, e-mail:contact@dpa.gr.\n''',
                textAlign: TextAlign.justify,
              ),
              Text(
                '''Περισσότερες πληροφορίες σχετικά με την Διοργανώτρια, τον σκοπό και το χρόνο επεξεργασίας των προσωπικών σας δεδομένων, τον τρόπο άσκησης των δικαιωμάτων σας, καθώς και γενικότερα εκτενέστερες πληροφορίες σχετικά με την επεξεργασία των δεδομένων σας προσωπικού χαρακτήρα, μπορείτε να βρείτε στην Δήλωση Προστασίας Δεδομένων της Διοργανώτριας, στην ιστοσελίδα της www.antenna.gr.\n''',
                textAlign: TextAlign.justify,
              ),
              Text('''Στοιχεία επικοινωνίας Υπευθύνου Προστασίας Δεδομένων (DPO)
Για την άσκηση των παραπάνω δικαιωμάτων σας, μπορείτε να απευθυνθείτε στον
Υπεύθυνο Προστασίας Δεδομένων:
dataprotection@antenna.gr
Λ. Κηφισίας 10-12, Μαρούσι
Τηλέφωνο επικοινωνίας: 2106886100
Όνομα και Διεύθυνση Υπευθύνου Επεξεργασίας
Ο Υπεύθυνος Επεξεργασίας, ως ορίζεται από το GDPR και την ισχύουσα νομοθεσία για
την προστασία των προσωπικών δεδομένων, είναι
ANTENNA TV
Λεωφ. Κηφισίας 10-12, Μαρούσι 15125
τηλ: 210 6886100
dataprotection@antenna.gr\n''', textAlign: TextAlign.justify),
            ],
          ),
        ),
      ),
    );
  }
}
